IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0g1x0x_g3x0x/COMP2_1.0.xml
        <register id="COMP2_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="COMPIFG" description="Raw interrupt status for comparator output interrupt flag. The IES bit defines the transition of the comparator output setting this bit." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No interrupt pending"/>
                <bitenum id="SET" value="0x1" description="Interrupt pending"/>
            </bitfield>
            <bitfield id="COMPINVIFG" description="Raw interrupt status for comparator output inverted interrupt flag. The IES bit defines the transition of the comparator output setting this bit." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No interrupt pending"/>
                <bitenum id="SET" value="0x1" description="Interrupt pending"/>
            </bitfield>
            <bitfield id="OUTRDYIFG" description="Raw interrupt status for comparator output ready interrupt flag. This bit is set when the comparator output is valid." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No interrupt pending"/>
                <bitenum id="SET" value="0x1" description="Interrupt pending"/>
            </bitfield>
        </register>
        <register id="COMP2_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="COMPIFG" description="Masked interrupt status for COMPIFG" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="COMPIFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="COMPIFG requests an interrupt service routine"/>
            </bitfield>
            <bitfield id="COMPINVIFG" description="Masked interrupt status for COMPINVIFG" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="COMPINVIFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="COMPINVIFG requests an interrupt service routine"/>
            </bitfield>
            <bitfield id="OUTRDYIFG" description="Masked interrupt status for OUTRDYIFG" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="OUTRDYIFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="OUTRDYIFG requests an interrupt service routine"/>
            </bitfield>
        </register>
        <register id="COMP2_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="COMPIFG" description="Sets COMPIFG in RIS register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to COMPIFG is set"/>
            </bitfield>
            <bitfield id="COMPINVIFG" description="Sets COMPINVIFG in RIS register" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to COMPINVIFG is set"/>
            </bitfield>
            <bitfield id="OUTRDYIFG" description="Sets OUTRDYIFG in RIS register" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to OUTRDYIFG is set"/>
            </bitfield>
        </register>
        <register id="COMP2_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="COMPIFG" description="Clears COMPIFG in RIS register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to COMPIFG is cleared"/>
            </bitfield>
            <bitfield id="COMPINVIFG" description="Clears COMPINVIFG in RIS register" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to COMPINVIFG is cleared"/>
            </bitfield>
            <bitfield id="OUTRDYIFG" description="Clears OUTRDYIFG in RIS register" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to OUTRDYIFG is cleared"/>
            </bitfield>
        </register>
    </group>
    <register id="COMP2_EVT_MODE" width="32" offset="0x10E0" description="Event Mode">
        <bitfield id="INT0_CFG" description="Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT][0]" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="Event handled by software. Software must clear the associated RIS flag."/>
            <bitenum id="HARDWARE" value="0x2" description="Event handled by hardware. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="EVT1_CFG" description="Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT][0]" begin="3" end="2" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="Event handled by software. Software must clear the associated RIS flag."/>
            <bitenum id="HARDWARE" value="0x2" description="Event handled by hardware. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
    </register>
