IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0g1x0x_g3x0x/COMP2_1.0.xml
    <register id="COMP2_CTL2" width="32" offset="0x1108" description="Control 2">
        <bitfield id="REFMODE" description="This bit requests ULP_REF bandgap operation in static mode or sampled mode. The local reference buffer and 8-bit DAC inside comparator module are also configured accordingly. 
Static mode operation offers higher accuracy but consumes higher current. Sampled mode operation consumes lower current but with relaxed reference voltage accuracy. Comparator requests for reference voltage from ULP_REF only when REFLVL &gt; 0." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="STATIC" value="0x0" description="ULP_REF bandgap, local reference buffer and 8-bit DAC inside comparator operate in static mode."/>
            <bitenum id="SAMPLED" value="0x1" description="ULP_REF bandgap, local reference buffer and 8-bit DAC inside comparator operate in sampled mode."/>
        </bitfield>
        <bitfield id="REFSRC" description="These bits select the reference source for the comparator." begin="4" end="3" width="2" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="Reference voltage generator is disabled (local reference buffer as well as DAC)."/>
            <bitenum id="VDDA_DAC" value="0x1" description="VDDA selected as the reference source to DAC and DAC output applied as reference to comparator."/>
            <bitenum id="VREF_DAC" value="0x2" description="VREF selected as reference to DAC and DAC output applied as reference to comparator."/>
            <bitenum id="VREF" value="0x3" description="VREF applied as reference to comparator. DAC is switched off."/>
        </bitfield>
        <bitfield id="REFSEL" description="This bit selects if the selected reference voltage is applied to positive or negative terminal of the comparator." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="POSITIVE" value="0x0" description="If EXCH bit is 0, the selected reference is applied to positive terminal. If EXCH bit is 1, the selected reference is applied to negative terminal."/>
            <bitenum id="NEGATIVE" value="0x1" description="If EXCH bit is 0, the selected reference is applied to negative terminal. If EXCH bit is 1, the selected reference is applied to positive terminal."/>
        </bitfield>
        <bitfield id="DACCTL" description="This bit determines if the comparator output or DACSW bit controls the selection between DACCODE0 and DACCODE1." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="COMPOUT_SEL" value="0x0" description="Comparator output controls selection between DACCODE0 and DACCODE1"/>
            <bitenum id="DACSW_SEL" value="0x1" description="DACSW bit controls selection between DACCODE0 and DACCODE1"/>
        </bitfield>
        <bitfield id="DACSW" description="This bit selects between DACCODE0 and DACCODE1 to 8-bit DAC when DACCTL bit is 1." begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="DACCODE0_SEL" value="0x0" description="DACCODE0 selected for 8-bit DAC"/>
            <bitenum id="DACCODE1_SEL" value="0x1" description="DACCODE1 selected for 8-bit DAC"/>
        </bitfield>
        <bitfield id="BLANKSRC" description="These bits select the blanking source for the comparator." begin="10" end="8" width="3" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Blanking source disabled"/>
            <bitenum id="BLANKSRC1" value="0x1" description="Select Blanking Source 1"/>
            <bitenum id="BLANKSRC2" value="0x2" description="Select Blanking Source 2"/>
            <bitenum id="BLANKSRC3" value="0x3" description="Select Blanking Source 3"/>
            <bitenum id="BLANKSRC4" value="0x4" description="Select Blanking Source 4"/>
            <bitenum id="BLANKSRC5" value="0x5" description="Select Blanking Source 5"/>
            <bitenum id="BLANKSRC6" value="0x6" description="Select Blanking Source 6"/>
        </bitfield>
        <bitfield id="SAMPMODE" description="Enable sampled mode of comparator." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Sampled mode disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Sampled mode enabled"/>
        </bitfield>
    </register>
    <register id="COMP2_CTL3" width="32" offset="0x110C" description="Control 3">
        <bitfield id="DACCODE0" description="This is the first 8-bit DAC code. When the DAC code is 0x0 the DAC output will be 0 V. When the DAC code is 0xFF the DAC output will be selected reference voltage x 255/256." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="Minimum DAC code value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Minimum DAC code value"/>
        </bitfield>
        <bitfield id="DACCODE1" description="This is the second 8-bit DAC code. When the DAC code is 0x0 the DAC output will be 0 V. When the DAC code is 0xFF the DAC output will be selected reference voltage x 255/256." begin="23" end="16" width="8" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="Minimum DAC code value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Minimum DAC code value"/>
        </bitfield>
    </register>
    <register id="COMP2_STAT" width="32" offset="0x1120" description="Status">
        <bitfield id="OUT" description="This bit reflects the value of the comparator output. Writing to this bit has no effect on the comparator output." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="LOW" value="0x0" description="Comparator output is low"/>
            <bitenum id="HIGH" value="0x1" description="Comparator output is high"/>
        </bitfield>
    </register>
</module>
